# Pandas Concepts & Practice

This notebook contains my practice work and exploration of different Pandas concepts. It's designed as a learning resource for anyone interested in mastering Pandas.

**Author:** Prayanshu Chourasia  
**Date:** December 2025  
**LinkedIn:** [Prayanshu Chourasia](https://www.linkedin.com/in/prayanshuchourasia01/)  
**GitHub:** [Prayanshu Chourasia/AI-ML-Notebook-Hub](https://github.com/Prayanshuchourasia-01/AI-ML-Notebook-Hub)

## Contents

- Pandas basics
- DataFrames and Series
- Data manipulation
- Data cleaning
- Indexing and selection
- Grouping and aggregation

## Overview

This notebook covers fundamental Pandas concepts with practical examples and exercises. It's suitable for beginners and intermediate learners.

## Prerequisites

- Python 3.8+
- Pandas 1.3+
- NumPy 1.20+
- Jupyter Notebook

## Usage

1. Clone this repository
2. Open the notebook in Jupyter
3. Run cells in order
4. Experiment with the code

## Contact

For questions or feedback, please reach out:

- Email: prayanshuchourasia01@gmail.com
- LinkedIn: [Prayanshu Chourasia](https://www.linkedin.com/in/prayanshuchourasia01/)

---

**Note:** This is a learning resource. Feel free to fork, reference, or use this for educational purposes.

%pip install xlrd

# Importing Pandas as pd

In [2]:
import pandas as pd

# Read the Data from .csv file using Pandas

In [3]:
df = pd.read_csv("Datasets\For pandas\sales_data_sample.csv",encoding = "latin1")
# here we use encoding = latin1 , so that computer can understand the data 
print(df)

      ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
0           10107               30      95.70                2  2871.00
1           10121               34      81.35                5  2765.90
2           10134               41      94.74                2  3884.34
3           10145               45      83.26                6  3746.70
4           10159               49     100.00               14  5205.27
...           ...              ...        ...              ...      ...
2818        10350               20     100.00               15  2244.40
2819        10373               29     100.00                1  3978.51
2820        10386               43     100.00                4  5417.57
2821        10397               34      62.24                1  2116.16
2822        10414               47      65.52                9  3079.44

            ORDERDATE    STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
0      2/24/2003 0:00   Shipped       1         2     2003  ...
1       5/7/2003 0:00   Shipped       2         5     2003  ...
2       7/1/2003 0:00   Shipped       3         7     2003  ...
3      8/25/2003 0:00   Shipped       3         8     2003  ...
4     10/10/2003 0:00   Shipped       4        10     2003  ...
...               ...       ...     ...       ...      ...  ...
2818   12/2/2004 0:00   Shipped       4        12     2004  ...
2819   1/31/2005 0:00   Shipped       1         1     2005  ...
2820    3/1/2005 0:00  Resolved       1         3     2005  ...
2821   3/28/2005 0:00   Shipped       1         3     2005  ...
2822    5/6/2005 0:00   On Hold       2         5     2005  ...

                       ADDRESSLINE1  ADDRESSLINE2           CITY STATE  \
0           897 Long Airport Avenue           NaN            NYC    NY
1                59 rue de l'Abbaye           NaN          Reims   NaN
2     27 rue du Colonel Pierre Avia           NaN          Paris   NaN
3                78934 Hillside Dr.           NaN       Pasadena    CA
4                   7734 Strong St.           NaN  San Francisco    CA
...                             ...           ...            ...   ...
2818             C/ Moralzarzal, 86           NaN         Madrid   NaN
2819                    Torikatu 38           NaN           Oulu   NaN
2820             C/ Moralzarzal, 86           NaN         Madrid   NaN
2821          1 rue Alsace-Lorraine           NaN       Toulouse   NaN
2822             8616 Spinnaker Dr.           NaN         Boston    MA

     POSTALCODE  COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
0         10022      USA       NaN              Yu             Kwai    Small
1         51100   France      EMEA         Henriot             Paul    Small
2         75508   France      EMEA        Da Cunha           Daniel   Medium
3         90003      USA       NaN           Young            Julie   Medium
4           NaN      USA       NaN           Brown            Julie   Medium
...         ...      ...       ...             ...              ...      ...
2818      28034    Spain      EMEA          Freyre            Diego    Small
2819      90110  Finland      EMEA       Koskitalo           Pirkko   Medium
2820      28034    Spain      EMEA          Freyre            Diego   Medium
2821      31000   France      EMEA          Roulet          Annette    Small
2822      51003      USA       NaN         Yoshido             Juri   Medium

[2823 rows x 25 columns]

# Read the Data from .xlsx (excel) file using Pandas

In [4]:
df = pd.read_excel("Datasets\For pandas\SampleSuperstore.xlsx")
print(df)

      Row ID        Order ID Order Date  Ship Date       Ship Mode  \
0          1  CA-2016-152156 2016-11-08 2016-11-11    Second Class
1          2  CA-2016-152156 2016-11-08 2016-11-11    Second Class
2          3  CA-2016-138688 2016-06-12 2016-06-16    Second Class
3          4  US-2015-108966 2015-10-11 2015-10-18  Standard Class
4          5  US-2015-108966 2015-10-11 2015-10-18  Standard Class
...      ...             ...        ...        ...             ...
9989    9990  CA-2014-110422 2014-01-21 2014-01-23    Second Class
9990    9991  CA-2017-121258 2017-02-26 2017-03-03  Standard Class
9991    9992  CA-2017-121258 2017-02-26 2017-03-03  Standard Class
9992    9993  CA-2017-121258 2017-02-26 2017-03-03  Standard Class
9993    9994  CA-2017-119914 2017-05-04 2017-05-09    Second Class

     Customer ID     Customer Name    Segment        Country             City  \
0       CG-12520       Claire Gute   Consumer  United States        Henderson
1       CG-12520       Claire Gute   Consumer  United States        Henderson
2       DV-13045   Darrin Van Huff  Corporate  United States      Los Angeles
3       SO-20335    Sean O'Donnell   Consumer  United States  Fort Lauderdale
4       SO-20335    Sean O'Donnell   Consumer  United States  Fort Lauderdale
...          ...               ...        ...            ...              ...
9989    TB-21400  Tom Boeckenhauer   Consumer  United States            Miami
9990    DB-13060       Dave Brooks   Consumer  United States       Costa Mesa
9991    DB-13060       Dave Brooks   Consumer  United States       Costa Mesa
9992    DB-13060       Dave Brooks   Consumer  United States       Costa Mesa
9993    CC-12220      Chris Cortes   Consumer  United States      Westminster

      ... Postal Code  Region       Product ID         Category Sub-Category  \
0     ...       42420   South  FUR-BO-10001798        Furniture    Bookcases
1     ...       42420   South  FUR-CH-10000454        Furniture       Chairs
2     ...       90036    West  OFF-LA-10000240  Office Supplies       Labels
3     ...       33311   South  FUR-TA-10000577        Furniture       Tables
4     ...       33311   South  OFF-ST-10000760  Office Supplies      Storage
...   ...         ...     ...              ...              ...          ...
9989  ...       33180   South  FUR-FU-10001889        Furniture  Furnishings
9990  ...       92627    West  FUR-FU-10000747        Furniture  Furnishings
9991  ...       92627    West  TEC-PH-10003645       Technology       Phones
9992  ...       92627    West  OFF-PA-10004041  Office Supplies        Paper
9993  ...       92683    West  OFF-AP-10002684  Office Supplies   Appliances

                                           Product Name     Sales  Quantity  \
0                     Bush Somerset Collection Bookcase  261.9600         2
1     Hon Deluxe Fabric Upholstered Stacking Chairs,...  731.9400         3
2     Self-Adhesive Address Labels for Typewriters b...   14.6200         2
3         Bretford CR4500 Series Slim Rectangular Table  957.5775         5
4                        Eldon Fold 'N Roll Cart System   22.3680         2
...                                                 ...       ...       ...
9989                             Ultra Door Pull Handle   25.2480         3
9990  Tenex B1-RE Series Chair Mats for Low Pile Car...   91.9600         2
9991                              Aastra 57i VoIP phone  258.5760         2
9992  It's Hot Message Books with Stickers, 2 3/4" x 5"   29.6000         4
9993  Acco 7-Outlet Masterpiece Power Center, Wihtou...  243.1600         2

      Discount    Profit
0         0.00   41.9136
1         0.00  219.5820
2         0.00    6.8714
3         0.45 -383.0310
4         0.20    2.5164
...        ...       ...
9989      0.20    4.1028
9990      0.00   15.6332
9991      0.20   19.3932
9992      0.00   13.3200
9993      0.00   72.9480

[9994 rows x 21 columns]

# Read the Data from .json file using Pandas

In [5]:
df = pd.read_json("Datasets\For pandas\sample_Data.json")
print(df)

    id                                               name  \
0    1                                    Apple iPhone 12
1    2                                 Samsung Galaxy S21
2    3                                 Sony PlayStation 5
3    4                  LG OLED55CXPUA 55-inch 4K OLED TV
4    5        Bose QuietComfort 35 II Wireless Headphones
5    6                          Fitbit Versa 3 Smartwatch
6    7                             KitchenAid Stand Mixer
7    8                 Dyson V11 Absolute Cordless Vacuum
8    9                         Ninja Foodi Smart XL Grill
9   10                    Canon EOS Rebel T8i DSLR Camera
10  11                                  Apple AirPods Pro
11  12        Bose QuietComfort 35 II Wireless Headphones
12  13                    Fitbit Charge 4 Fitness Tracker
13  14                              Samsung Galaxy Watch3
14  15  Sony WH-1000XM4 Wireless Noise-Cancelling Head...
15  16          Breville Barista Express Espresso Machine
16  17                        Keurig K-Elite Coffee Maker
17  18                     iRobot Roomba i7+ Robot Vacuum
18  19                   Ninja Foodi Digital Air Fry Oven
19  20                   Cuisinart ICE-70 Ice Cream Maker

                                          description    price  \
0   The Apple iPhone 12 features a 6.1-inch Super ...   999.00
1   The Samsung Galaxy S21 features a 6.2-inch Dyn...   799.00
2   The Sony PlayStation 5 features an AMD Zen 2-b...   499.99
3   The LG OLED55CXPUA 55-inch 4K OLED TV features...  1599.99
4   The Bose QuietComfort 35 II Wireless Headphone...   299.00
5   The Fitbit Versa 3 Smartwatch features a built...   229.95
6   The KitchenAid Stand Mixer features a 5-quart ...   399.99
7   The Dyson V11 Absolute Cordless Vacuum feature...   699.99
8   The Ninja Foodi Smart XL Grill features 6-in-1...   279.99
9   The Canon EOS Rebel T8i DSLR Camera features a...   899.00
10  The Apple AirPods Pro feature active noise can...   249.00
11  The Bose QuietComfort 35 II Wireless Headphone...   299.00
12  The Fitbit Charge 4 Fitness Tracker features G...   129.95
13  The Samsung Galaxy Watch3 features a rotating ...   399.99
14  The Sony WH-1000XM4 Wireless Noise-Cancelling ...   349.99
15  The Breville Barista Express Espresso Machine ...   699.95
16  The Keurig K-Elite Coffee Maker features a str...   169.99
17  The iRobot Roomba i7+ Robot Vacuum features au...   799.99
18  The Ninja Foodi Digital Air Fry Oven features ...   209.99
19  The Cuisinart ICE-70 Ice Cream Maker features ...   139.99

           category                                              image
0       Electronics  https://www.apple.com/newsroom/images/product/...
1       Electronics  https://images.samsung.com/is/image/samsung/p6...
2       Electronics  https://www.sony.com/image/44baa604124b770c824...
3       Electronics  https://www.lg.com/us/images/tvs/md07501804/ga...
4       Electronics  https://assets.bose.com/content/dam/Bose_DAM/W...
5       Electronics  https://www.fitbit.com/global/content/dam/fitb...
6    Home & Kitchen  https://www.kitchenaid.com/content/dam/global/...
7   Home Appliances  https://www.dysoncanada.ca/dam/dyson/images/pr...
8    Home & Kitchen  https://www.ninjakitchen.com/medias/Ninja-OP50...
9       Electronics  https://www.canon.com.au/-/media/images/produc...
10      Electronics  https://www.apple.com/v/airpods-pro/b/images/m...
11      Electronics  https://assets.bose.com/content/dam/Bose_DAM/W...
12      Electronics  https://www.fitbit.com/global/content/dam/fitb...
13      Electronics  https://images.samsung.com/is/image/samsung/as...
14      Electronics  https://www.sony.com/image/1cdd6354c4cd21cc4f7...
15   Home & Kitchen  https://www.breville.com/content/dam/breville/...
16   Home & Kitchen  https://www.keurig.com/content/dam/global-ecom...
17   Home & Kitchen  https://store.irobot.com/default/i7-vacuuming-...
18   Home & Kitchen  https://www.ninjakitchen.com/static/img/produc...
19   Home & Kitchen  https://www.cuisinart.com/share/images/product...

# How To Save the Data in CSV file

In [4]:
data = {
    "Name":['Ash','Win','Sad'],
    "Age":[12,15,18],
    "City":['Guna','ujjain','hiii']
}
df = pd.DataFrame(data) # this will create the dataset of the given data. 
print(df)  
# THen we will print the dataFrame, so then we get one more additiional column of index. 

df.to_csv("output.csv") 
# By this to_csv() we can convert our data to csv format. #NOTE : in that csv there will be addtional column of Index. 

df.to_csv("output2.csv",index=False) 
# By addition Index = false we can remove that additional column.

  Name  Age    City
0  Ash   12    Guna
1  Win   15  ujjain
2  Sad   18    hiii

# How to save data in the excel format

In [ ]:
data = {
    "Name":['Ash','Win','Sad'],
    "Age":[12,15,18],
    "City":['Guna','ujjain','hiii']
}
df = pd.DataFrame(data) # this will create the dataset of the given data. 
print(df)  
# THen we will print the dataFrame, so then we get one more additiional column of index. 

df.to_excel("OutExl.xlsx");
# To convert the Dataframe to Excel file use this cmd.

df.to_excel("OutExl2.xlsx",index=False) # to remove the index and convert it into the excel format we can use this..

# How to Save data in the json format

In [ ]:
data = {
    "Name":['Ash','Win','Sad'],
    "Age":[12,15,18],
    "City":['Guna','ujjain','hiii']
}
df = pd.DataFrame(data) # this will create the dataset of the given data. 
print(df)  
# THen we will print the dataFrame, so then we get one more additiional column of index. 


df.to_json("OutJson.json")      # To convert the data frame to the json format 
df.to_join("OutJson2.njson",index=False) # to remove the index and convert it into the json format we can this ......

# Exploring the Data using head() & tail()

In [6]:
# head(n) ---> it returns the first n rows of the Dataset , and if n is not provided then by default it returns 5 rows 
# tail(n) ---> it returns the last n rows of the dataset , and if n is not provided then by default it returns 5 rows 

df = pd.read_json("Datasets\For pandas\sample_Data.json")
print("Head Method : ")
print(df.head())    # it will return only first 5  rows 
print(df.head(10))  # it will return n(10) first rows 

print("Tail Method : ")
print(df.tail())   # it will return bottom 5 rows 
print(df.tail(10)) # it will return bottom 10 rows

Head Method :
   id                                         name  \
0   1                              Apple iPhone 12
1   2                           Samsung Galaxy S21
2   3                           Sony PlayStation 5
3   4            LG OLED55CXPUA 55-inch 4K OLED TV
4   5  Bose QuietComfort 35 II Wireless Headphones

                                         description    price     category  \
0  The Apple iPhone 12 features a 6.1-inch Super ...   999.00  Electronics
1  The Samsung Galaxy S21 features a 6.2-inch Dyn...   799.00  Electronics
2  The Sony PlayStation 5 features an AMD Zen 2-b...   499.99  Electronics
3  The LG OLED55CXPUA 55-inch 4K OLED TV features...  1599.99  Electronics
4  The Bose QuietComfort 35 II Wireless Headphone...   299.00  Electronics

                                               image
0  https://www.apple.com/newsroom/images/product/...
1  https://images.samsung.com/is/image/samsung/p6...
2  https://www.sony.com/image/44baa604124b770c824...
3  https://www.lg.com/us/images/tvs/md07501804/ga...
4  https://assets.bose.com/content/dam/Bose_DAM/W...
   id                                         name  \
0   1                              Apple iPhone 12
1   2                           Samsung Galaxy S21
2   3                           Sony PlayStation 5
3   4            LG OLED55CXPUA 55-inch 4K OLED TV
4   5  Bose QuietComfort 35 II Wireless Headphones
5   6                    Fitbit Versa 3 Smartwatch
6   7                       KitchenAid Stand Mixer
7   8           Dyson V11 Absolute Cordless Vacuum
8   9                   Ninja Foodi Smart XL Grill
9  10              Canon EOS Rebel T8i DSLR Camera

                                         description    price  \
0  The Apple iPhone 12 features a 6.1-inch Super ...   999.00
1  The Samsung Galaxy S21 features a 6.2-inch Dyn...   799.00
2  The Sony PlayStation 5 features an AMD Zen 2-b...   499.99
3  The LG OLED55CXPUA 55-inch 4K OLED TV features...  1599.99
4  The Bose QuietComfort 35 II Wireless Headphone...   299.00
5  The Fitbit Versa 3 Smartwatch features a built...   229.95
6  The KitchenAid Stand Mixer features a 5-quart ...   399.99
7  The Dyson V11 Absolute Cordless Vacuum feature...   699.99
8  The Ninja Foodi Smart XL Grill features 6-in-1...   279.99
9  The Canon EOS Rebel T8i DSLR Camera features a...   899.00

          category                                              image
0      Electronics  https://www.apple.com/newsroom/images/product/...
1      Electronics  https://images.samsung.com/is/image/samsung/p6...
2      Electronics  https://www.sony.com/image/44baa604124b770c824...
3      Electronics  https://www.lg.com/us/images/tvs/md07501804/ga...
4      Electronics  https://assets.bose.com/content/dam/Bose_DAM/W...
5      Electronics  https://www.fitbit.com/global/content/dam/fitb...
6   Home & Kitchen  https://www.kitchenaid.com/content/dam/global/...
7  Home Appliances  https://www.dysoncanada.ca/dam/dyson/images/pr...
8   Home & Kitchen  https://www.ninjakitchen.com/medias/Ninja-OP50...
9      Electronics  https://www.canon.com.au/-/media/images/produc...
Tail Method :
    id                                       name  \
15  16  Breville Barista Express Espresso Machine
16  17                Keurig K-Elite Coffee Maker
17  18             iRobot Roomba i7+ Robot Vacuum
18  19           Ninja Foodi Digital Air Fry Oven
19  20           Cuisinart ICE-70 Ice Cream Maker

                                          description   price        category  \
15  The Breville Barista Express Espresso Machine ...  699.95  Home & Kitchen
16  The Keurig K-Elite Coffee Maker features a str...  169.99  Home & Kitchen
17  The iRobot Roomba i7+ Robot Vacuum features au...  799.99  Home & Kitchen
18  The Ninja Foodi Digital Air Fry Oven features ...  209.99  Home & Kitchen
19  The Cuisinart ICE-70 Ice Cream Maker features ...  139.99  Home & Kitchen

                                                image
15  https://www.breville.com/content/dam/breville/...
16  https://www.keurig.com/content/dam/global-ecom...
17  https://store.irobot.com/default/i7-vacuuming-...
18  https://www.ninjakitchen.com/static/img/produc...
19  https://www.cuisinart.com/share/images/product...
    id                                               name  \
10  11                                  Apple AirPods Pro
11  12        Bose QuietComfort 35 II Wireless Headphones
12  13                    Fitbit Charge 4 Fitness Tracker
13  14                              Samsung Galaxy Watch3
14  15  Sony WH-1000XM4 Wireless Noise-Cancelling Head...
15  16          Breville Barista Express Espresso Machine
16  17                        Keurig K-Elite Coffee Maker
17  18                     iRobot Roomba i7+ Robot Vacuum
18  19                   Ninja Foodi Digital Air Fry Oven
19  20                   Cuisinart ICE-70 Ice Cream Maker

                                          description   price        category  \
10  The Apple AirPods Pro feature active noise can...  249.00     Electronics
11  The Bose QuietComfort 35 II Wireless Headphone...  299.00     Electronics
12  The Fitbit Charge 4 Fitness Tracker features G...  129.95     Electronics
13  The Samsung Galaxy Watch3 features a rotating ...  399.99     Electronics
14  The Sony WH-1000XM4 Wireless Noise-Cancelling ...  349.99     Electronics
15  The Breville Barista Express Espresso Machine ...  699.95  Home & Kitchen
16  The Keurig K-Elite Coffee Maker features a str...  169.99  Home & Kitchen
17  The iRobot Roomba i7+ Robot Vacuum features au...  799.99  Home & Kitchen
18  The Ninja Foodi Digital Air Fry Oven features ...  209.99  Home & Kitchen
19  The Cuisinart ICE-70 Ice Cream Maker features ...  139.99  Home & Kitchen

                                                image
10  https://www.apple.com/v/airpods-pro/b/images/m...
11  https://assets.bose.com/content/dam/Bose_DAM/W...
12  https://www.fitbit.com/global/content/dam/fitb...
13  https://images.samsung.com/is/image/samsung/as...
14  https://www.sony.com/image/1cdd6354c4cd21cc4f7...
15  https://www.breville.com/content/dam/breville/...
16  https://www.keurig.com/content/dam/global-ecom...
17  https://store.irobot.com/default/i7-vacuuming-...
18  https://www.ninjakitchen.com/static/img/produc...
19  https://www.cuisinart.com/share/images/product...

# Understanding data using info() method

In [7]:
# info() method ---> tells you about the number of row and column your dataset have , column names and the type of data those column are storing , 
# and also tells that if there is any missing value is there in the dataset of any column or not , and the menory usage of the data frame. 

df = pd.read_json("Datasets\For pandas\sample_Data.json")
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           20 non-null     int64
 1   name         20 non-null     object
 2   description  20 non-null     object
 3   price        20 non-null     float64
 4   category     20 non-null     object
 5   image        20 non-null     object
dtypes: float64(1), int64(1), object(4)
memory usage: 1.1+ KB
None

# To summary of the descriptive Statistics using describe() method

In [8]:
# describe() ---->  a Summary of descriptive statistics for numerical columns in the dataframe.

df = pd.read_csv("Datasets\For pandas\sales_data_sample.csv",encoding="latin1")

print(df.describe()) # This method gives us the statistics things , like mean,std(standard deviation) , min,max,25% ....

        ORDERNUMBER  QUANTITYORDERED    PRICEEACH  ORDERLINENUMBER  \
count   2823.000000      2823.000000  2823.000000      2823.000000
mean   10258.725115        35.092809    83.658544         6.466171
std       92.085478         9.741443    20.174277         4.225841
min    10100.000000         6.000000    26.880000         1.000000
25%    10180.000000        27.000000    68.860000         3.000000
50%    10262.000000        35.000000    95.700000         6.000000
75%    10333.500000        43.000000   100.000000         9.000000
max    10425.000000        97.000000   100.000000        18.000000

              SALES       QTR_ID     MONTH_ID     YEAR_ID         MSRP
count   2823.000000  2823.000000  2823.000000  2823.00000  2823.000000
mean    3553.889072     2.717676     7.092455  2003.81509   100.715551
std     1841.865106     1.203878     3.656633     0.69967    40.187912
min      482.130000     1.000000     1.000000  2003.00000    33.000000
25%     2203.430000     2.000000     4.000000  2003.00000    68.000000
50%     3184.800000     3.000000     8.000000  2004.00000    99.000000
75%     4508.000000     4.000000    11.000000  2004.00000   124.000000
max    14082.800000     4.000000    12.000000  2005.00000   214.000000

# Using Shapes & Column attribute

In [8]:
df = pd.read_csv("Datasets\For pandas\sales_data_sample.csv",encoding= "latin1")

print(f"Shape : {df.shape}") # it returns the 2 values in a tuple (rows,columns) 
print(f"Column : {df.columns}") # it returns the names of the columns in the dataset.

Shape : (2823, 25)
Column : Index(['ORDERNUMBER', 'QUANTITYORDERED', 'PRICEEACH', 'ORDERLINENUMBER',
       'SALES', 'ORDERDATE', 'STATUS', 'QTR_ID', 'MONTH_ID', 'YEAR_ID',
       'PRODUCTLINE', 'MSRP', 'PRODUCTCODE', 'CUSTOMERNAME', 'PHONE',
       'ADDRESSLINE1', 'ADDRESSLINE2', 'CITY', 'STATE', 'POSTALCODE',
       'COUNTRY', 'TERRITORY', 'CONTACTLASTNAME', 'CONTACTFIRSTNAME',
       'DEALSIZE'],
      dtype='object')

# Selecting Specfic Columns.

In [9]:

df = pd.read_csv("Datasets\For pandas/sales_data_sample.csv",encoding="latin1")

#print(df)
# select Specific column

city = df["CITY"]
print(city)
print("\n")
print(df["SALES"])

# selection multiple columns 
subset = df[["CITY","SALES"]]
print(subset)

0                 NYC
1               Reims
2               Paris
3            Pasadena
4       San Francisco
            ...
2818           Madrid
2819             Oulu
2820           Madrid
2821         Toulouse
2822           Boston
Name: CITY, Length: 2823, dtype: object


0       2871.00
1       2765.90
2       3884.34
3       3746.70
4       5205.27
         ...
2818    2244.40
2819    3978.51
2820    5417.57
2821    2116.16
2822    3079.44
Name: SALES, Length: 2823, dtype: float64
               CITY    SALES
0               NYC  2871.00
1             Reims  2765.90
2             Paris  3884.34
3          Pasadena  3746.70
4     San Francisco  5205.27
...             ...      ...
2818         Madrid  2244.40
2819           Oulu  3978.51
2820         Madrid  5417.57
2821       Toulouse  2116.16
2822         Boston  3079.44

[2823 rows x 2 columns]

#  Filtering of Rows

In [10]:
df = pd.read_csv("Datasets\For pandas/sales_data_sample.csv",encoding="latin1")

#print(df)

# filter rows 
high_sales = df[df["SALES"]>10000]
print(high_sales)

# Filtering Rows  based on the multiple conditons 

multiFilter = df[(df["SALES"]>10000) & (df["QUANTITYORDERED"]>50)]
print(multiFilter)

      ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
30          10150               45      100.0                8  10993.5
43          10304               47      100.0                6  10172.7
44          10312               48      100.0                3  11623.7
53          10424               50      100.0                6  12001.0
104         10403               66      100.0                9  11886.6
188         10127               46      100.0                2  11279.2
198         10247               44      100.0                2  10606.2
598         10407               76      100.0                2  14082.8
744         10322               50      100.0                6  12536.5
1062        10412               60      100.0                9  11887.8
1133        10333               46      100.0                2  11336.7
1188        10406               65      100.0                1  10468.9
1839        10339               55      100.0               13  10758.0
1995        10405               76      100.0                3  11739.7
2117        10375               43      100.0                2  10039.6
2505        10388               46      100.0                2  10066.6

            ORDERDATE      STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
30     9/19/2003 0:00     Shipped       3         9     2003  ...
43    10/11/2004 0:00     Shipped       4        10     2004  ...
44    10/21/2004 0:00     Shipped       4        10     2004  ...
53     5/31/2005 0:00  In Process       2         5     2005  ...
104     4/8/2005 0:00     Shipped       2         4     2005  ...
188     6/3/2003 0:00     Shipped       2         6     2003  ...
198     5/5/2004 0:00     Shipped       2         5     2004  ...
598    4/22/2005 0:00     On Hold       2         4     2005  ...
744    11/4/2004 0:00     Shipped       4        11     2004  ...
1062    5/3/2005 0:00     Shipped       2         5     2005  ...
1133  11/18/2004 0:00     Shipped       4        11     2004  ...
1188   4/15/2005 0:00    Disputed       2         4     2005  ...
1839  11/23/2004 0:00     Shipped       4        11     2004  ...
1995   4/14/2005 0:00     Shipped       2         4     2005  ...
2117    2/3/2005 0:00     Shipped       1         2     2005  ...
2505    3/3/2005 0:00     Shipped       1         3     2005  ...

                              ADDRESSLINE1  ADDRESSLINE2           CITY  \
30    Bronz Sok., Bronz Apt. 3/6 Tesvikiye           NaN      Singapore
43                  67, avenue de l'Europe           NaN     Versailles
44                         5677 Strong St.           NaN     San Rafael
53                      C/ Moralzarzal, 86           NaN         Madrid
104           Berkeley Gardens 12  Brewery           NaN      Liverpool
188                      4092 Furth Circle     Suite 400            NYC
198    Software Engineering Center, SEC Oy           NaN          Espoo
598                         3086 Ingle Ln.           NaN       San Jose
744               2304 Long Airport Avenue           NaN         Nashua
1062                    C/ Moralzarzal, 86           NaN         Madrid
1133             5557 North Pendale Street           NaN  San Francisco
1188                          Vinb'ltet 34           NaN      Kobenhavn
1839                        2-2-8 Roppongi           NaN      Minato-ku
1995                      24, place Kluber           NaN     Strasbourg
2117          67, rue des Cinquante Otages           NaN         Nantes
2505                     1785 First Street           NaN    New Bedford

      STATE POSTALCODE    COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME  \
30      NaN      79903  Singapore     Japan       Natividad             Eric
43      NaN      78000     France      EMEA          Tonini           Daniel
44       CA      97562        USA       NaN          Nelson          Valarie
53      NaN      28034      Spain      EMEA          Freyre            Diego
104     NaN    WX1 6LT         UK      EMEA           Devon        Elizabeth
188      NY      10022        USA       NaN           Young             Jeff
198     NaN  FIN-02271    Finland      EMEA        Suominen            Kalle
598      CA      94217        USA       NaN           Frick              Sue
744      NH      62005        USA       NaN           Young          Valarie
1062    NaN      28034      Spain      EMEA          Freyre            Diego
1133     CA        NaN        USA       NaN          Murphy            Julie
1188    NaN       1734    Denmark      EMEA        Petersen            Jytte
1839  Tokyo   106-0032      Japan     Japan       Shimamura            Akiko
1995    NaN      67000     France      EMEA         Citeaux       Frederique
2117    NaN      44000     France      EMEA         Labrune           Janine
2505     MA      50553        USA       NaN         Benitez          Violeta

     DEALSIZE
30      Large
43      Large
44      Large
53      Large
104     Large
188     Large
198     Large
598     Large
744     Large
1062    Large
1133    Large
1188    Large
1839    Large
1995    Large
2117    Large
2505    Large

[16 rows x 25 columns]
      ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
104         10403               66      100.0                9  11886.6
598         10407               76      100.0                2  14082.8
1062        10412               60      100.0                9  11887.8
1188        10406               65      100.0                1  10468.9
1839        10339               55      100.0               13  10758.0
1995        10405               76      100.0                3  11739.7

            ORDERDATE    STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
104     4/8/2005 0:00   Shipped       2         4     2005  ...
598    4/22/2005 0:00   On Hold       2         4     2005  ...
1062    5/3/2005 0:00   Shipped       2         5     2005  ...
1188   4/15/2005 0:00  Disputed       2         4     2005  ...
1839  11/23/2004 0:00   Shipped       4        11     2004  ...
1995   4/14/2005 0:00   Shipped       2         4     2005  ...

                      ADDRESSLINE1  ADDRESSLINE2        CITY  STATE  \
104   Berkeley Gardens 12  Brewery           NaN   Liverpool    NaN
598                 3086 Ingle Ln.           NaN    San Jose     CA
1062            C/ Moralzarzal, 86           NaN      Madrid    NaN
1188                  Vinb'ltet 34           NaN   Kobenhavn    NaN
1839                2-2-8 Roppongi           NaN   Minato-ku  Tokyo
1995              24, place Kluber           NaN  Strasbourg    NaN

     POSTALCODE  COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
104     WX1 6LT       UK      EMEA           Devon        Elizabeth    Large
598       94217      USA       NaN           Frick              Sue    Large
1062      28034    Spain      EMEA          Freyre            Diego    Large
1188       1734  Denmark      EMEA        Petersen            Jytte    Large
1839   106-0032    Japan     Japan       Shimamura            Akiko    Large
1995      67000   France      EMEA         Citeaux       Frederique    Large

[6 rows x 25 columns]

# Working with OR conditions

In [11]:
df = pd.read_csv("Datasets\For pandas/sales_data_sample.csv",encoding="latin1")

# print(df)


# OR condtion : says that either any of the conditio gets true we will get the result. 
eitherFilter = df[(df["SALES"]>10000) | (df["COUNTRY"]=="Japan")]
print(eitherFilter)

      ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER     SALES  \
30          10150               45     100.00                8  10993.50
39          10258               32     100.00                6   7680.64
43          10304               47     100.00                6  10172.70
44          10312               48     100.00                3  11623.70
53          10424               50     100.00                6  12001.00
...           ...              ...        ...              ...       ...
2647        10210               25     100.00                6   2818.00
2672        10210               31      86.40               13   2678.40
2751        10210               42      70.33               15   2953.86
2762        10339               50      57.86                8   2893.00
2789        10339               27      76.31                6   2060.37

            ORDERDATE      STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
30     9/19/2003 0:00     Shipped       3         9     2003  ...
39     6/15/2004 0:00     Shipped       2         6     2004  ...
43    10/11/2004 0:00     Shipped       4        10     2004  ...
44    10/21/2004 0:00     Shipped       4        10     2004  ...
53     5/31/2005 0:00  In Process       2         5     2005  ...
...               ...         ...     ...       ...      ...  ...
2647   1/12/2004 0:00     Shipped       1         1     2004  ...
2672   1/12/2004 0:00     Shipped       1         1     2004  ...
2751   1/12/2004 0:00     Shipped       1         1     2004  ...
2762  11/23/2004 0:00     Shipped       4        11     2004  ...
2789  11/23/2004 0:00     Shipped       4        11     2004  ...

                                  ADDRESSLINE1  ADDRESSLINE2        CITY  \
30        Bronz Sok., Bronz Apt. 3/6 Tesvikiye           NaN   Singapore
39                              2-2-8 Roppongi           NaN   Minato-ku
43                      67, avenue de l'Europe           NaN  Versailles
44                             5677 Strong St.           NaN  San Rafael
53                          C/ Moralzarzal, 86           NaN      Madrid
...                                        ...           ...         ...
2647  Dojima Avanza 4F, 1-6-20 Dojima, Kita-ku           NaN       Osaka
2672  Dojima Avanza 4F, 1-6-20 Dojima, Kita-ku           NaN       Osaka
2751  Dojima Avanza 4F, 1-6-20 Dojima, Kita-ku           NaN       Osaka
2762                            2-2-8 Roppongi           NaN   Minato-ku
2789                            2-2-8 Roppongi           NaN   Minato-ku

      STATE POSTALCODE    COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME  \
30      NaN      79903  Singapore     Japan       Natividad             Eric
39    Tokyo   106-0032      Japan     Japan       Shimamura            Akiko
43      NaN      78000     France      EMEA          Tonini           Daniel
44       CA      97562        USA       NaN          Nelson          Valarie
53      NaN      28034      Spain      EMEA          Freyre            Diego
...     ...        ...        ...       ...             ...              ...
2647  Osaka   530-0003      Japan     Japan         Kentary             Mory
2672  Osaka   530-0003      Japan     Japan         Kentary             Mory
2751  Osaka   530-0003      Japan     Japan         Kentary             Mory
2762  Tokyo   106-0032      Japan     Japan       Shimamura            Akiko
2789  Tokyo   106-0032      Japan     Japan       Shimamura            Akiko

     DEALSIZE
30      Large
39      Large
43      Large
44      Large
53      Large
...       ...
2647    Small
2672    Small
2751    Small
2762    Small
2789    Small

[67 rows x 25 columns]

# Advance Pandas Funcitons 
## Adding Columns

In [50]:
data = {
    "Name" : ['A','B','C','D','E','F'],
    "Age" : ['1','2','3','4','5','6'],
    "Salary" : [50000,30000,20000,40000,60000,70000],
    "Performance_Score" : [ 65,89 ,62 , 78, 98, 21]    
}
df = pd.DataFrame(data)
# print(df)

# We have two methods to do this work.
# 1st --> using square brackets method df["column name"] = values or data of the columns


df["Bonus"] = df["Salary"] * 0.1  # 10% increaing  
#     df["Bonus"] = [100,200,300,400,500,600] ----> we can also do this 

print(df)



# 2nd --> using the insert() method to insert the column at the specific position
# df.insert(loc, "Column_name" ,Some_data) 

df.insert(0,"Index", [1,2,3,4,5,6])
print(df)

  Name Age  Salary  Performance_Score   Bonus
0    A   1   50000                 65  5000.0
1    B   2   30000                 89  3000.0
2    C   3   20000                 62  2000.0
3    D   4   40000                 78  4000.0
4    E   5   60000                 98  6000.0
5    F   6   70000                 21  7000.0
   Index Name Age  Salary  Performance_Score   Bonus
0      1    A   1   50000                 65  5000.0
1      2    B   2   30000                 89  3000.0
2      3    C   3   20000                 62  2000.0
3      4    D   4   40000                 78  4000.0
4      5    E   5   60000                 98  6000.0
5      6    F   6   70000                 21  7000.0

# Updating value in a DataFrame

In [53]:
data = {
    "Name" : ['A','B','C','D','E','F'],
    "Age" : ['1','2','3','4','5','6'],
    "Salary" : [50000,30000,20000,40000,60000,70000],
    "Performance_Score" : [ 65,89 ,62 , 78, 98, 21]    
}
df = pd.DataFrame(data)
print(df)
#   .loc[] ---> it is a method of pandas

# For Specific value of the Data Frame.
# df.loc[row index , "column name "] = new value 
df.loc[0,"Salary"] = 200
print(df)

  Name Age  Salary  Performance_Score
0    A   1   50000                 65
1    B   2   30000                 89
2    C   3   20000                 62
3    D   4   40000                 78
4    E   5   60000                 98
5    F   6   70000                 21
  Name Age  Salary  Performance_Score
0    A   1     200                 65
1    B   2   30000                 89
2    C   3   20000                 62
3    D   4   40000                 78
4    E   5   60000                 98
5    F   6   70000                 21

# Updating Whole Column Values

In [55]:
data = {
    "Name" : ['A','B','C','D','E','F'],
    "Age" : ['1','2','3','4','5','6'],
    "Salary" : [50000,30000,20000,40000,60000,70000],
    "Performance_Score" : [ 65,89 ,62 , 78, 98, 21]    
}
df = pd.DataFrame(data)
print(df) 

df["Salary"] = df["Salary"]*1.05
print(df)

  Name Age  Salary  Performance_Score
0    A   1   50000                 65
1    B   2   30000                 89
2    C   3   20000                 62
3    D   4   40000                 78
4    E   5   60000                 98
5    F   6   70000                 21
  Name Age   Salary  Performance_Score
0    A   1  52500.0                 65
1    B   2  31500.0                 89
2    C   3  21000.0                 62
3    D   4  42000.0                 78
4    E   5  63000.0                 98
5    F   6  73500.0                 21

# Removing Columns from the DataFrame using drop() method

In [15]:
data = {
    "Name" : ['A','B','C','D','E','F'],
    "Age" : ['1','2','3','4','5','6'],
    "Salary" : [50000,30000,20000,40000,60000,70000],
    "Performance_Score" : [ 65,89 ,62 , 78, 98, 21]    
}
df = pd.DataFrame(data)
# df.drop(columns = ["ColumnName"],inplace=true)   here inplace = true means it will change directly in the orifinal dataset
# if we put inplace = false , there it will return a new dataset.
df.drop(columns=["Performance_Score"],inplace = True) # For removing single columns
print(df)
print("Double : ")
df.drop(columns=["Age","Salary"],inplace=True) # For Removing multiple columns 
print(df)

  Name Age  Salary
0    A   1   50000
1    B   2   30000
2    C   3   20000
3    D   4   40000
4    E   5   60000
5    F   6   70000
Double :
  Name
0    A
1    B
2    C
3    D
4    E
5    F

# Decting/Identifing the Missing Data

In [21]:
# The missing data is represented as NAN[not a number] and none [For Object data type ]

# To Detect/identify where is missing data , we have a method ---> isnull() it returns a bool dataframe in which 
# True means [value is missing ] , False means [value is present]

data = {
    "Name" : ['A',None,'C','D','E','F'],
    "Age" : ['1','2','3',None,'5','6'],
    "Salary" : [50000,30000,None,40000,60000,70000],
    "Performance_Score" : [ 65,89 ,62 , None, 98, 21]    
}
df = pd.DataFrame(data)
print(df)

# isnull()

print(df.isnull()) # to find out where is the missing values 
print(df.isnull().sum()) # This is To find how many missing values are.

   Name   Age   Salary  Performance_Score
0     A     1  50000.0               65.0
1  None     2  30000.0               89.0
2     C     3      NaN               62.0
3     D  None  40000.0                NaN
4     E     5  60000.0               98.0
5     F     6  70000.0               21.0
    Name    Age  Salary  Performance_Score
0  False  False   False              False
1   True  False   False              False
2  False  False    True              False
3  False   True   False               True
4  False  False   False              False
5  False  False   False              False
Name                 1
Age                  1
Salary               1
Performance_Score    1
dtype: int64

# Handing Missing Data  --- using dropna()

In [26]:
# if any row or columns is not important and dont matters in the result of your program then its better we remove the whole either the column or row
# For that we use ---> df.dropna(axis=0,inplace=True) axis = 0 means row , axis = 1 means column , and inpalce true means change in original dataset

data = {
    "Name" : ['A',None,'C','D','E','F'],
    "Age" : ['1','2','3',None,'5','6'],
    "Salary" : [50000,30000,None,40000,60000,70000],
    "Performance_Score" : [ 65,89 ,62 , None, 98, 21]    
}
df = pd.DataFrame(data)
print(df)
# print(df.dropna(axis=0,inplace=True)) AXIS=0 works in rows , AXIS=1 works in COlumns 
print(df.dropna(inplace=True))

   Name   Age   Salary  Performance_Score
0     A     1  50000.0               65.0
1  None     2  30000.0               89.0
2     C     3      NaN               62.0
3     D  None  40000.0                NaN
4     E     5  60000.0               98.0
5     F     6  70000.0               21.0
None

# Handing Missing Data by filling data --- using fillna()

In [30]:
#fillna(value,inplace=True)
data = {
    "Name" : ['A',None,'C','D','E','F'],
    "Age" : ['1','2','3',None,'5','6'],
    "Salary" : [50000,30000,None,40000,60000,70000],
    "Performance_Score" : [ 65,89 ,62 , None, 98, 21]    
}
df = pd.DataFrame(data)
print(df)
print("Updated DataFrame")
df.fillna(0,inplace=True) # here we change the original dataset, adn replaced allt he missing values with 0.
print(df)
# NOTE we only use default values here.

   Name   Age   Salary  Performance_Score
0     A     1  50000.0               65.0
1  None     2  30000.0               89.0
2     C     3      NaN               62.0
3     D  None  40000.0                NaN
4     E     5  60000.0               98.0
5     F     6  70000.0               21.0
Updated DataFrame
  Name Age   Salary  Performance_Score
0    A   1  50000.0               65.0
1    0   2  30000.0               89.0
2    C   3      0.0               62.0
3    D   0  40000.0                0.0
4    E   5  60000.0               98.0
5    F   6  70000.0               21.0

# Handing Missing Data by filling calculated data --- using fillna()

In [36]:
data = {
    "Name" : ['A',None,'C','D','E','F'],
    "Age" : [1,2,3,None,5,6],
    "Salary" : [50000,30000,None,40000,60000,70000],
    "Performance_Score" : [ 65,89 ,62 , None, 98, 21]    
}
df = pd.DataFrame(data)
print(df)
print("Updated DataFrame")
df["Age"].fillna(df["Age"].mean(),inplace=True)
# print(df["Salary"].fillna(df["Salary"].mean(),inplace=False))
df["Salary"].fillna(df["Salary"].mean(),inplace=True)
df["Performance_Score"].fillna(df["Performance_Score"].mean(),inplace=True)

print(df)

   Name  Age   Salary  Performance_Score
0     A  1.0  50000.0               65.0
1  None  2.0  30000.0               89.0
2     C  3.0      NaN               62.0
3     D  NaN  40000.0                NaN
4     E  5.0  60000.0               98.0
5     F  6.0  70000.0               21.0
Updated DataFrame
   Name  Age   Salary  Performance_Score
0     A  1.0  50000.0               65.0
1  None  2.0  30000.0               89.0
2     C  3.0  50000.0               62.0
3     D  3.4  40000.0               67.0
4     E  5.0  60000.0               98.0
5     F  6.0  70000.0               21.0

C:\Users\praya\AppData\Local\Temp\ipykernel_9240\3817170127.py:10: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Age"].fillna(df["Age"].mean(),inplace=True)
C:\Users\praya\AppData\Local\Temp\ipykernel_9240\3817170127.py:12: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Salary"].fillna(df["Salary"].mean(),inplace=True)
C:\Users\praya\AppData\Local\Temp\ipykernel_9240\3817170127.py:13: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Performance_Score"].fillna(df["Performance_Score"].mean(),inplace=True)

# Filling Missing Values in the dataframe using linear method of interpolate

In [3]:
# interpolate() --- we can use it to fill the missing values in any column or dataframe , it finds a extimate of the other values 
# Benefits of using this --- 
# 1- preserve data integrity
# 2- smooth trends 
# 3- Avoid Data Loss 

#when to use interpolate():
# 1- Timer Series Data 
# 2- numeric data with trends
# 3- avoid dropping rows 

data = {
    "Name" : ['A',None,'C','D','E','F'],
    "Age" : [1,2,3,None,5,6],
    "Salary" : [50000,30000,None,40000,60000,70000],
    "Performance_Score" : [ 65,89 ,62 , None, 98, 21]    
}
df = pd.DataFrame(data)
print(df)
print("Modified : ")
df.interpolate(method="linear",axis=0,inplace=True)
print(df)

# There are some types of methods : 
# 1- linear 
# 2- polynomial
# 3- time

   Name  Age   Salary  Performance_Score
0     A  1.0  50000.0               65.0
1  None  2.0  30000.0               89.0
2     C  3.0      NaN               62.0
3     D  NaN  40000.0                NaN
4     E  5.0  60000.0               98.0
5     F  6.0  70000.0               21.0
Modified :
   Name  Age   Salary  Performance_Score
0     A  1.0  50000.0               65.0
1  None  2.0  30000.0               89.0
2     C  3.0  35000.0               62.0
3     D  4.0  40000.0               80.0
4     E  5.0  60000.0               98.0
5     F  6.0  70000.0               21.0

C:\Users\praya\AppData\Local\Temp\ipykernel_22324\3655786885.py:16: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(method="linear",axis=0,inplace=True)

# Sorting & Aggregation

## Sorting Data 1 Column sort_values()

In [6]:
# df.sort_values(by="Column Name",ascending = True/False,inplace=True) ---> true means ascending order , false means desending order.

data = {
    "Name" : ['A','G','C','D','E','F'],
    "Age" : [1,2,3,8,5,6],
    "Salary" : [50000,30000,000,40000,60000,70000],
    "Performance_Score" : [ 65,89 ,62 , 00, 98, 21]    
}
df = pd.DataFrame(data)
print(df)
df.sort_values(by="Name",ascending=True,inplace=True)
print(df)
df.sort_values(by="Name",ascending=False,inplace=True)
print(df)

  Name  Age  Salary  Performance_Score
0    A    1   50000                 65
1    G    2   30000                 89
2    C    3       0                 62
3    D    8   40000                  0
4    E    5   60000                 98
5    F    6   70000                 21
  Name  Age  Salary  Performance_Score
0    A    1   50000                 65
2    C    3       0                 62
3    D    8   40000                  0
4    E    5   60000                 98
5    F    6   70000                 21
1    G    2   30000                 89
  Name  Age  Salary  Performance_Score
1    G    2   30000                 89
5    F    6   70000                 21
4    E    5   60000                 98
3    D    8   40000                  0
2    C    3       0                 62
0    A    1   50000                 65

## Sorting Data Multiple Column sort_values()

In [11]:
data = {
    "Name" : ['A','G','C','D','E','F'],
    "Age" : [1,2,3,8,5,6],
    "Salary" : [50000,30000,000,40000,60000,70000],
    "Performance_Score" : [ 65,89 ,62 , 00, 98, 21]    
}
df = pd.DataFrame(data)
print(df)
df.sort_values(by=["Age","Name"],ascending=[False,True],inplace=True)  # here we have to pass the multiple values in the list.
print(df)

  Name  Age  Salary  Performance_Score
0    A    1   50000                 65
1    G    2   30000                 89
2    C    3       0                 62
3    D    8   40000                  0
4    E    5   60000                 98
5    F    6   70000                 21
  Name  Age  Salary  Performance_Score
3    D    8   40000                  0
5    F    6   70000                 21
4    E    5   60000                 98
2    C    3       0                 62
1    G    2   30000                 89
0    A    1   50000                 65

# Aggregation--- > sum() , min() , max() , count() ... etc

In [18]:
data = {
    "Name" : ['A','G','C','D','E','F'],
    "Age" : [1,2,3,8,5,6],
    "Salary" : [50000,30000,000,40000,60000,70000],
    "Performance_Score" : [ 65,89 ,62 , 00, 98, 21]    
}
df = pd.DataFrame(data)
print(df)
print(df["Age"].sum())
print(df["Age"].count())
print(df["Age"].min())
print(df["Age"].max())
print(df["Age"].mean())
# ETC

  Name  Age  Salary  Performance_Score
0    A    1   50000                 65
1    G    2   30000                 89
2    C    3       0                 62
3    D    8   40000                  0
4    E    5   60000                 98
5    F    6   70000                 21
25
6
1
8
4.166666666666667

# Grouping Of Data and using of Aggregation methods

In [19]:
# using groupby("Column Name")["Column Name 2 "]                       ---> ("ColumnName") is the grouping column 
data = {                                  #                            ---> ["Column Name 2 "] is the 
    "Name" : ['A','G','C','D','E','F'],
    "Age" : [1,2,3,8,5,6],
    "Salary" : [50000,30000,000,40000,60000,70000],
    "Performance_Score" : [ 65,89 ,62 , 00, 98, 21]    
}
df = pd.DataFrame(data)
print(df)
grouped= df.groupby("Age")["Salary"].mean()
print(grouped)

  Name  Age  Salary  Performance_Score
0    A    1   50000                 65
1    G    2   30000                 89
2    C    3       0                 62
3    D    8   40000                  0
4    E    5   60000                 98
5    F    6   70000                 21
Age
1    50000.0
2    30000.0
3        0.0
5    60000.0
6    70000.0
8    40000.0
Name: Salary, dtype: float64

# Grouping Multiple Columns

In [3]:
# using groupby(["Column Name","Column Name ])["Column Name 2 "]       ---> ["Col Name","Col name "] here we are giving it as a list to group multiple columns
data = {                                  #                            ---> ["Column Name 2 "] is the operation we have to preform 
    "Name" : ['A','G','C','D','E','F'],
    "Age" : [1,2,3,8,5,6],
    "Salary" : [50000,30000,000,40000,60000,70000],
    "Performance_Score" : [ 65,89 ,62 , 00, 98, 21]    
}
df = pd.DataFrame(data)
print(df)
grouped= df.groupby(["Age","Name"])["Salary"].sum()
print(grouped)

  Name  Age  Salary  Performance_Score
0    A    1   50000                 65
1    G    2   30000                 89
2    C    3       0                 62
3    D    8   40000                  0
4    E    5   60000                 98
5    F    6   70000                 21
Age  Name
1    A       50000
2    G       30000
3    C           0
5    E       60000
6    F       70000
8    D       40000
Name: Salary, dtype: int64

# Merging & Joining  --- using inner Join

In [5]:
# df.merge( df1 , df2 , on = "Column_Name" , how = "Type of Join " )

df_customer = pd.DataFrame({
    'CustomerId' : [1,2,3],
    'Name' : ["Ashwin","Ash","Serina"]
})

df_order = pd.DataFrame({
    'CustomerId' : [1,2,4],
    'OrderAmount' : [456,576,887]
})

# Merged 
df_merge = pd.merge(df_customer,df_order,on="CustomerId",how = "inner")
print("Inner Joined : ")
print(df_merge)

Inner Joined :
   CustomerId    Name  OrderAmount
0           1  Ashwin          456
1           2     Ash          576

# Merging & Joining  --- using outer Join

In [6]:
df_customer = pd.DataFrame({
    'CustomerId' : [1,2,3],
    'Name' : ["Ashwin","Ash","Serina"]
})

df_order = pd.DataFrame({
    'CustomerId' : [1,2,4],
    'OrderAmount' : [456,576,887]
})

# Merged 
df_merge = pd.merge(df_customer,df_order,on="CustomerId",how = "outer")
print("Outer Joined : ")
print(df_merge)

Outer Joined :
   CustomerId    Name  OrderAmount
0           1  Ashwin        456.0
1           2     Ash        576.0
2           3  Serina          NaN
3           4     NaN        887.0

# Merging & Joining  --- using Left Join

In [7]:
df_customer = pd.DataFrame({
    'CustomerId' : [1,2,3],
    'Name' : ["Ashwin","Ash","Serina"]
})

df_order = pd.DataFrame({
    'CustomerId' : [1,2,4],
    'OrderAmount' : [456,576,887]
})

# Merged 
df_merge = pd.merge(df_customer,df_order,on="CustomerId",how = "left")
print("Left Joined : ")
print(df_merge)

Left Joined :
   CustomerId    Name  OrderAmount
0           1  Ashwin        456.0
1           2     Ash        576.0
2           3  Serina          NaN

# Merging & Joining  --- using Right Join

In [8]:
df_customer = pd.DataFrame({
    'CustomerId' : [1,2,3],
    'Name' : ["Ashwin","Ash","Serina"]
})

df_order = pd.DataFrame({
    'CustomerId' : [1,2,4],
    'OrderAmount' : [456,576,887]
})

# Merged 
df_merge = pd.merge(df_customer,df_order,on="CustomerId",how = "right")
print("Right Joined : ")
print(df_merge)

Right Joined :
   CustomerId    Name  OrderAmount
0           1  Ashwin          456
1           2     Ash          576
2           4     NaN          887

# Merging & Joining  --- using Cross Join

In [12]:
df_customer = pd.DataFrame({
    'CustomerId' : [1,2,3],
    'Name' : ["Ashwin","Ash","Serina"]
})

df_order = pd.DataFrame({
    'CustomerId' : [1,2,4],
    'OrderAmount' : [456,576,887]
})

# Merged 
df_merge = pd.merge(df_customer,df_order,how = "cross")
print("Cross Joined : ")
print(df_merge)

Cross Joined :
   CustomerId_x    Name  CustomerId_y  OrderAmount
0             1  Ashwin             1          456
1             1  Ashwin             2          576
2             1  Ashwin             4          887
3             2     Ash             1          456
4             2     Ash             2          576
5             2     Ash             4          887
6             3  Serina             1          456
7             3  Serina             2          576
8             3  Serina             4          887

# Concating DataFrames

In [16]:
""" 
Vertically (Row-Wise)
HoriZontally (Column-Wise)

pd.concat([df1,df2],axis= 0 , ignore_index=True )

[df1,df2]  --> passing dataframe as the list..
axis = 0 (Row Wise Concation )
axis = 1 (Column Wise concation )

ignore_index = True --> That means it will ignore the default dataframes indexs and make a new one in the concated dataframe

"""

df_customer = pd.DataFrame({
    'CustomerId' : [1,2,3],
    'Name' : ["Ashwin","Ash","Serina"]
})

df_order = pd.DataFrame({
    'CustomerId' : [1,2,4],
    'OrderAmount' : [456,576,887]
})

# CONCATE

df_concate = pd.concat([df_customer,df_order],axis=0,ignore_index = True)
print(df_concate)

   CustomerId    Name  OrderAmount
0           1  Ashwin          NaN
1           2     Ash          NaN
2           3  Serina          NaN
3           1     NaN        456.0
4           2     NaN        576.0
5           4     NaN        887.0

# So Now The Pandas Is Finished .We Will Move Forward To The Projects Now.